

//============================================================================
// Name        : инфа.cpp
// Author      : 
// Version     :
// Copyright   : Your copyright notice
// Description : Hello World in C++, Ansi-style
//============================================================================

#include <iostream>
using namespace std;

int main() {
	/*int a = 0;
	cin >> a;
	if (a < 0 || a == 0) {
	cout << "Доход не может быть меньше нуля или равен нулю" << endl;
	}
	else if (a <= 50000) {
	cout << "Доход до 50 000 рублей облагается налогом 13%" << endl;
	}
	else if (a > 50000 || a <= 100000) {
	cout << "Доход от 50 001 до 100 000 рублей облагается налогом 20%" << endl;
	}
	else if (a > 100000) {
	cout << "Доход выше 100 000 рублей облагается налогом 25%" << endl;
	}

	return 0;*/
	int a = 0;
	cout << "Ваш доход:";
	cin >> a;


	    if (a <= 0) {
	        cout << "Доход не может быть меньше или равен нулю" << endl;
	    }
	    else if (a <= 50000) {
	        float tax = a * 0.13;
	        cout << "Доход до 50 000 рублей облагается налогом 13%" << endl;
	        cout << "Сумма налога: " << tax << " рублей" << endl;
	    }
	    else if (a <= 100000) {
	        float tax = a * 0.20;
	        cout << "Доход от 50 001 до 100 000 рублей облагается налогом 20%" << endl;
	        cout << "Сумма налога: " << tax << " рублей" << endl;
	    }
	    else {
	        float tax = a * 0.25;
	        cout << "Доход выше 100 000 рублей облагается налогом 25%" << endl;
	        cout << "Сумма налога: " << tax  << " рублей" << endl;
	    }

}
